ninety_nine__cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "name1000"], ["description", "        description0\r\n    "], ["updated_at", "2019-01-29 23:44:49.879063"], ["id", 12]]
---
    def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)